Data ingestion notebook using pandas â€” build a Jupyter notebook that loads CSV/JSON/text data, handles missing values, normalizes column names, performs simple EDA (head(), describe(), value_counts()), and exports a cleaned CSV.

In [3]:
import pandas as pd
import numpy as np
from pathlib import Path

In [6]:
RAW_DIR = Path("./data/raw")
PROCESSED_DIR = Path("./data/processed")
PROCESSED_DIR.mkdir(parents=True, exist_ok=True)

FILE_NAME = "tmdb_movies.csv"   # change this, not your code

In [7]:
def load_data(file_path: Path) -> pd.DataFrame:
    ext = file_path.suffix.lower()

    if ext == ".csv":
        return pd.read_csv(file_path)

    if ext == ".json":
        return pd.read_json(file_path)

    if ext in [".txt", ".tsv"]:
        return pd.read_csv(file_path, sep=None, engine="python")

    raise ValueError(f"Unsupported format: {ext}")


df = load_data(RAW_DIR / FILE_NAME)

In [8]:
df.head()

,id,title,genre,release_date,release_year,budget,revenue,runtime,vote_average,vote_count,production_country
0,1,Movie Title 1,"Science Fiction, Comedy, Horror",1957-01-01,1957,36972721,1.306928e+08,123,4.496790,9221,Germany
1,2,Movie Title 2,"Documentary, Romance",1999-01-01,1999,96359319,2.947975e+08,146,5.803306,4592,China
2,3,Movie Title 3,"Science Fiction, Action",1941-01-01,1941,135172742,1.048409e+08,168,2.710639,7146,Japan
3,4,Movie Title 4,"Comedy, Drama, Adventure",1961-01-01,1961,129049379,1.535585e+08,134,5.631398,8363,Germany
4,5,Movie Title 5,"Comedy, Romance",1969-01-01,1969,151390401,1.008291e+08,116,4.245862,9487,Japan

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  100 non-null    int64
 1   title               100 non-null    object
 2   genre               100 non-null    object
 3   release_date        100 non-null    object
 4   release_year        100 non-null    int64
 5   budget              100 non-null    int64
 6   revenue             100 non-null    float64
 7   runtime             100 non-null    int64
 8   vote_average        100 non-null    float64
 9   vote_count          100 non-null    int64
 10  production_country  100 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 8.7+ KB

In [10]:
def clean_column_names(df: pd.DataFrame) -> pd.DataFrame:
    df = df.copy()
    df.columns = (
        df.columns
        .str.strip()
        .str.lower()
        .str.replace(" ", "_")
        .str.replace(r"[^\w]", "", regex=True)
    )
    return df


df = clean_column_names(df)
df.head()

,id,title,genre,release_date,release_year,budget,revenue,runtime,vote_average,vote_count,production_country
0,1,Movie Title 1,"Science Fiction, Comedy, Horror",1957-01-01,1957,36972721,1.306928e+08,123,4.496790,9221,Germany
1,2,Movie Title 2,"Documentary, Romance",1999-01-01,1999,96359319,2.947975e+08,146,5.803306,4592,China
2,3,Movie Title 3,"Science Fiction, Action",1941-01-01,1941,135172742,1.048409e+08,168,2.710639,7146,Japan
3,4,Movie Title 4,"Comedy, Drama, Adventure",1961-01-01,1961,129049379,1.535585e+08,134,5.631398,8363,Germany
4,5,Movie Title 5,"Comedy, Romance",1969-01-01,1969,151390401,1.008291e+08,116,4.245862,9487,Japan

In [11]:
df.isna().sum().sort_values(ascending=False)

id                    0
title                 0
genre                 0
release_date          0
release_year          0
budget                0
revenue               0
runtime               0
vote_average          0
vote_count            0
production_country    0
dtype: int64

In [12]:
df.describe(include="all")

,id,title,genre,release_date,release_year,budget,revenue,runtime,vote_average,vote_count,production_country
count,100.000000,100,100,100,100.00000,1.000000e+02,1.000000e+02,100.000000,100.000000,100.000000,100
unique,NaN,100,69,59,NaN,NaN,NaN,NaN,NaN,NaN,8
top,NaN,Movie Title 1,Adventure,1983-01-01,NaN,NaN,NaN,NaN,NaN,NaN,Canada
freq,NaN,1,8,4,NaN,NaN,NaN,NaN,NaN,NaN,16
mean,50.500000,NaN,NaN,NaN,1980.89000,1.199285e+08,3.325427e+08,128.560000,5.403200,5498.100000,NaN
std,29.011492,NaN,NaN,NaN,24.03066,7.501923e+07,2.760798e+08,29.265183,2.716531,2844.219378,NaN
min,1.000000,NaN,NaN,NaN,1940.00000,1.581646e+06,4.004654e+06,80.000000,1.076640,21.000000,NaN
25%,25.750000,NaN,NaN,NaN,1961.00000,4.954816e+07,9.697859e+07,102.500000,2.898215,3057.500000,NaN
50%,50.500000,NaN,NaN,NaN,1981.00000,1.174061e+08,2.541225e+08,132.000000,5.157603,5714.500000,NaN
75%,75.250000,NaN,NaN,NaN,1999.25000,1.881243e+08,5.287118e+08,151.000000,7.944961,8172.750000,NaN
max,100.000000,NaN,NaN,NaN,2024.00000,2.452930e+08,1.105000e+09,177.000000,9.956007,9990.000000,NaN

In [13]:
for col in df.select_dtypes(include="object"):
    print(f"\n{col}")
    print(df[col].value_counts().head())

title
title
Movie Title 1    1
Movie Title 2    1
Movie Title 3    1
Movie Title 4    1
Movie Title 5    1
Name: count, dtype: int64

genre
genre
Adventure      8
Horror         5
Action         3
Documentary    3
Drama          3
Name: count, dtype: int64

release_date
release_date
1983-01-01    4
2007-01-01    3
2022-01-01    3
1964-01-01    3
1952-01-01    3
Name: count, dtype: int64

production_country
production_country
Canada            16
India             14
France            14
China             13
United Kingdom    13
Name: count, dtype: int64

In [14]:
df.duplicated().sum()

np.int64(0)

In [16]:
def safe_to_numeric(series: pd.Series) -> pd.Series:
    try:
        return pd.to_numeric(series)
    except (ValueError, TypeError):
        return series


for col in df.columns:
    df[col] = safe_to_numeric(df[col])

In [17]:
OUTPUT_FILE = PROCESSED_DIR / "customers_clean.csv"
df.to_csv(OUTPUT_FILE, index=False)

print("Exported:", OUTPUT_FILE)

Exported: data\processed\customers_clean.csv

The data was clean from its source.